roblatour/ESP32TimeServer/main/main.cpp
struct sync_state_t
{
    int64_t last_successful_sync_us = 0;
    int64_t last_sync_attempt_us = 0;
    int64_t last_pps_seen_us = 0;
    time_t last_sync_delta_seconds = 0;
    uint32_t consecutive_sync_failures = 0;
    uint32_t consecutive_sanity_failures = 0;
    bool holdover_mode = false;
    bool pps_active = false;
    bool gnss_timing_valid = false;
    int64_t last_gnss_valid_us = 0;
    sync_fault_t fault = sync_fault_t::none;
};

struct sync_candidate_t
{
    time_t candidate_time = 0;
    bool use_pps_alignment = false;
    bool used_nmea_fallback = false;
    int64_t pps_release_time_us = 0;
    sync_fault_t failure = sync_fault_t::none;
};

static sync_state_t s_sync_state{};
static sync_state_t get_sync_state_snapshot();
static constexpr int64_t Sync_Stale_After_Us = static_cast<int64_t>(periodicGPSRefreshEveryThisNumberOfMinutes) * 60LL * 1000000LL * 3LL;
static constexpr int64_t Gnss_Validity_Timeout_Us = 3500000LL;
static constexpr int64_t Sync_Reboot_After_Us = 30LL * 60LL * 1000000LL;
static constexpr int64_t Max_Sync_Attempt_Us = 10000000LL;
static constexpr int64_t Gnss_Invalid_Reacquisition_After_Us = 30LL * 1000000LL;
static constexpr int64_t Runtime_Gps_Recovery_Min_Interval_Us = 5LL * 60LL * 1000000LL;
static constexpr uint32_t Sync_Failures_Before_Runtime_Recovery = 20;
static constexpr uint32_t Sanity_Failures_Before_Fault = 2;
static constexpr uint32_t GPS_Startup_Qualification_Duration_Ms = 15000UL;
static constexpr uint32_t GPS_Startup_Qualification_PPS_Edges = 10;
static constexpr int64_t GPS_Startup_Min_PPS_Interval_Us = 800000LL;
static constexpr int64_t GPS_Startup_Max_PPS_Interval_Us = 1200000LL;
static constexpr uint32_t GPS_Time_Sync_Task_Stack_Size = 4096;
static constexpr uint32_t PPS_Discipline_Task_Stack_Size = 3072;
static constexpr uint32_t GPS_Recovery_Task_Stack_Size = 12288;

static constexpr char GPS_NVS_NAMESPACE[] = "gps_state";
static constexpr char GPS_NVS_KEY_ID_TYPE[] = "id_type";
static constexpr char GPS_NVS_KEY_ID_VALUE[] = "id_value";
static constexpr char GPS_NVS_KEY_MAX_BAUD[] = "max_baud";
static constexpr char GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY[] = "no_sig_rcv";

static constexpr char GPS_ID_TYPE_UNIQID[] = "uniqid";
static constexpr char GPS_ID_TYPE_MODULE_FP[] = "module_fp";
static constexpr char GPS_ID_TYPE_GENERIC[] = "generic";
static constexpr char GPS_ID_VALUE_UNDETERMINED[] = "undetermined_gps_board";

struct gps_identity_t
{
    bool valid = false;
    char type[16] = "";
    char value[96] = "";
};

struct gps_nvs_data_t
{
    bool has_id_type = false;
    char id_type[16] = "";
    char id_value[96] = "";
    uint32_t max_baud = 0;
    bool has_attempt_no_signal_recovery = false;
    bool attempt_no_signal_recovery = true;
};

static uint32_t s_gps_target_baud = 0;
static bool s_attempt_no_signal_recovery = true;

struct nmea_rmc_time_t
{
    int year = 0;
    int month = 0;
    int day = 0;
    int hour = 0;
    int minute = 0;
    int second = 0;
};

static void refresh_sync_state_locked(sync_state_t *state, int64_t now_us)
{
    if (state == nullptr)
        return;

    bool sync_stale = state->last_successful_sync_us > 0 && (now_us - state->last_successful_sync_us) > Sync_Stale_After_Us;
    bool pps_missing = s_time_has_been_set.load() && !state->pps_active;
    bool gnss_missing = s_time_has_been_set.load() && (!state->gnss_timing_valid ||
                                                       state->last_gnss_valid_us == 0 ||
                                                       (now_us - state->last_gnss_valid_us) > Gnss_Validity_Timeout_Us);

    if (sync_stale)
    {
        state->fault = sync_fault_t::sync_stale;
    }
    else if (gnss_missing)
    {
        state->fault = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "GNSS invalid - GNSS missing.");
#endif
    }
    else if (pps_missing)
    {
        state->fault = sync_fault_t::pps_missing;
    }
    else if (state->fault == sync_fault_t::pps_missing || state->fault == sync_fault_t::gps_invalid || state->fault == sync_fault_t::sync_stale)
    {
        state->fault = sync_fault_t::none;
    }

    state->holdover_mode = sync_stale || pps_missing || gnss_missing || state->fault != sync_fault_t::none;
}

static void sync_state_note_attempt()
{
    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.last_sync_attempt_us = esp_timer_get_time();
        refresh_sync_state_locked(&s_sync_state, s_sync_state.last_sync_attempt_us);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void sync_state_note_pps_edge(int64_t edge_us)
{
    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.last_pps_seen_us = edge_us;
        s_sync_state.pps_active = true;
        refresh_sync_state_locked(&s_sync_state, edge_us);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void sync_state_note_pps_timeout(int64_t now_us)
{
    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_sync_state.pps_active = false;
        refresh_sync_state_locked(&s_sync_state, now_us);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

static void set_gnss_lock_state(bool valid)
{
    int64_t now_us = esp_timer_get_time();
    bool previous = s_gnss_locked.exchange(valid);
    if (previous == valid)
        return;

    if (valid)
    {
        s_gnss_lock_started_us.store(now_us);
#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
        s_last_gnss_lock.store(time(nullptr));
#endif
    }
    else
    {
        int64_t lock_started_us = s_gnss_lock_started_us.exchange(0);
        if (lock_started_us > 0 && now_us > lock_started_us)
            s_gnss_locked_total_us.fetch_add(now_us - lock_started_us);
#if MQTT_ENABLED && MQTT_HISTORICAL_REPORTING_ENABLED
        s_last_gnss_unlock.store(time(nullptr));
#endif
    }
}

static void sync_state_note_gnss_validity(bool valid)
{
    set_gnss_lock_state(valid);

    if (xSemaphoreTake(s_sync_state_mutex, portMAX_DELAY) == pdTRUE)
    {
        int64_t now_us = esp_timer_get_time();
        s_sync_state.gnss_timing_valid = valid;
        if (valid)
            s_sync_state.last_gnss_valid_us = now_us;
        refresh_sync_state_locked(&s_sync_state, now_us);
        xSemaphoreGive(s_sync_state_mutex);
    }
}

