roblatour/ESP32TimeServer/main/main.cpp
static void display_selected_ip_address(int seconds)
{
    if (s_ip_address[0] == '\0')
    {
        display_line(3, "");
        return;
    }

    if (strcmp(s_ip_address, s_ipv4_address) == 0)
    {
        display_line(3, s_ip_address);
        return;
    }

    char ipv6_part1[IP_ADDRESS_TEXT_SIZE] = "";
    char ipv6_part2[IP_ADDRESS_TEXT_SIZE] = "";
    size_t total_len = strlen(s_ip_address);
    size_t half_len = total_len / 2;
    while (half_len < total_len && s_ip_address[half_len] != ':')
        half_len++;

    size_t remainder_len = total_len - half_len;
    strncpy(ipv6_part1, s_ip_address, half_len);
    ipv6_part1[half_len] = '\0';
    strncpy(ipv6_part2, s_ip_address + half_len, remainder_len);
    ipv6_part2[remainder_len] = '\0';

    if (seconds < 30)
        display_line(3, ipv6_part1);
    else
        display_line(3, ipv6_part2);
}

static void apply_timezone_settings()
{
    setenv("TZ", timeZoneSpec, 1);
    tzset();
}

static void format_local_date_time(time_t utc_time, char *date_string, size_t date_size, char *time_string, size_t time_size)
{
    struct tm local_tm{};
    localtime_r(&utc_time, &local_tm);

    snprintf(date_string, date_size, "%04d-%02d-%02d", local_tm.tm_year + 1900, local_tm.tm_mon + 1, local_tm.tm_mday);

    int hour_value = local_tm.tm_hour % 12;
    if (hour_value == 0)
        hour_value = 12;

    const char *ampm = local_tm.tm_hour < 12 ? "AM" : "PM";
    char zone[8] = "";
    if (displayTimeZone)
        strftime(zone, sizeof(zone), "%Z", &local_tm);

    if (displayTimeZone && zone[0] != '\0')
    {
        snprintf(time_string, time_size, "%d:%02d:%02d %s %s", hour_value, local_tm.tm_min, local_tm.tm_sec, ampm, zone);
    }
    else
    {
        snprintf(time_string, time_size, "%d:%02d:%02d %s", hour_value, local_tm.tm_min, local_tm.tm_sec, ampm);
    }
}

static void get_uptime(char *buffer, size_t buffer_size)
{
    uint64_t total_seconds = static_cast<uint64_t>(esp_timer_get_time() / 1000000ULL);
    uint64_t days = total_seconds / 86400ULL;
    total_seconds %= 86400ULL;
    uint64_t hours = total_seconds / 3600ULL;
    total_seconds %= 3600ULL;
    uint64_t minutes = total_seconds / 60ULL;
    uint64_t seconds = total_seconds % 60ULL;
    snprintf(buffer, buffer_size, "%llu %02llu:%02llu:%02llu", days, hours, minutes, seconds);
}

static bool initialize_nvs_storage()
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND)
    {
        err = nvs_flash_erase();
        if (err != ESP_OK)
            return false;
        err = nvs_flash_init();
    }

    if (err != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "nvs_flash_init failed: %s", esp_err_to_name(err));
#endif
        return false;
    }

    return true;
}

static bool parse_mac_id_string(const char *text, uint8_t mac[6])
{
    if (text == nullptr || mac == nullptr || text[0] == '\0' || std::strlen(text) != 17)
        return false;

    if (text[2] != ':' || text[5] != ':' || text[8] != ':' || text[11] != ':' || text[14] != ':')
        return false;

    unsigned int values[6] = {};
    if (std::sscanf(text,
                    "%2x:%2x:%2x:%2x:%2x:%2x",
                    &values[0],
                    &values[1],
                    &values[2],
                    &values[3],
                    &values[4],
                    &values[5]) != 6)
        return false;

    for (size_t index = 0; index < 6; ++index)
        mac[index] = static_cast<uint8_t>(values[index]);

    return true;
}

static uint32_t get_highest_candidate_gps_baud()
{
    return 921600;
}

static void build_candidate_baud_rates(std::vector<uint32_t> &out, uint32_t preferred_baud)
{
    static constexpr uint32_t all_candidate_baud_rates[] = {921600, 460800, 230400, 115200, 57600, 38400, 19200, 9600, 4800};

    out.clear();

    if (preferred_baud > 0)
        out.push_back(preferred_baud);

    for (auto br : all_candidate_baud_rates)
    {
        if (br != preferred_baud)
            out.push_back(br);
    }
}

static bool load_gps_nvs_data(gps_nvs_data_t *data)
{
    if (data == nullptr)
        return false;

    *data = gps_nvs_data_t{};

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND)
        return true;
    if (err != ESP_OK)
        return false;

    size_t type_length = 0;
    err = nvs_get_str(handle, GPS_NVS_KEY_ID_TYPE, nullptr, &type_length);
    if (err == ESP_OK && type_length > 0)
    {
        if (type_length > sizeof(data->id_type))
            type_length = sizeof(data->id_type);
        if (nvs_get_str(handle, GPS_NVS_KEY_ID_TYPE, data->id_type, &type_length) == ESP_OK)
            data->has_id_type = data->id_type[0] != '\0';
    }

    size_t value_length = 0;
    err = nvs_get_str(handle, GPS_NVS_KEY_ID_VALUE, nullptr, &value_length);
    if (err == ESP_OK && value_length > 0)
    {
        if (value_length > sizeof(data->id_value))
            value_length = sizeof(data->id_value);
        (void)nvs_get_str(handle, GPS_NVS_KEY_ID_VALUE, data->id_value, &value_length);
    }

    (void)nvs_get_u32(handle, GPS_NVS_KEY_MAX_BAUD, &data->max_baud);

    uint8_t attempt_no_signal_recovery = 0;
    err = nvs_get_u8(handle, GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY, &attempt_no_signal_recovery);
    if (err == ESP_OK)
    {
        data->has_attempt_no_signal_recovery = true;
        data->attempt_no_signal_recovery = attempt_no_signal_recovery != 0;
    }

    nvs_close(handle);
    return true;
}

static bool save_gps_nvs_data(const gps_identity_t &identity, uint32_t max_baud)
{
    if (!identity.valid || identity.type[0] == '\0' || identity.value[0] == '\0' || max_baud == 0)
        return false;

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK)
        return false;

    err = nvs_set_str(handle, GPS_NVS_KEY_ID_TYPE, identity.type);
    if (err == ESP_OK)
        err = nvs_set_str(handle, GPS_NVS_KEY_ID_VALUE, identity.value);
    if (err == ESP_OK)
        err = nvs_set_u32(handle, GPS_NVS_KEY_MAX_BAUD, max_baud);
    if (err == ESP_OK)
        err = nvs_commit(handle);

    nvs_close(handle);
    return err == ESP_OK;
}

static bool save_attempt_no_signal_recovery_setting(bool enabled)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK)
        return false;

    err = nvs_set_u8(handle, GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY, enabled ? 1U : 0U);
    if (err == ESP_OK)
        err = nvs_commit(handle);

    nvs_close(handle);
    return err == ESP_OK;
}

