roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
                    if (!baud_change_command_reported_success)
                        ESP_LOGW(TAG, "GPS baud-rate change command to %lu was not acknowledged. Probing the target baud anyway.", static_cast<unsigned long>(gps_baud));
#endif

                    vTaskDelay(pdMS_TO_TICKS(200));

                    bool reconnect_without_assume = try_gps_begin(gps_baud, false, &saw_any_serial_data);
                    bool reconnect_with_assume = false;
                    if (!reconnect_without_assume)
                        reconnect_with_assume = try_gps_begin(gps_baud, true, &saw_any_serial_data);

                    if (reconnect_without_assume || reconnect_with_assume)
                    {
                        s_detected_gps_baud = gps_baud;
                        s_gps_required_assume_success = reconnect_with_assume;

#if DEBUG_ENABLED
                        if (!baud_change_command_reported_success)
                            ESP_LOGW(TAG, "GPS baud-rate change command to %lu reported failure, but reconnect succeeded at the new baud.", static_cast<unsigned long>(gps_baud));
#endif
                    }
                    else
                    {
                        bool old_baud_without_assume = try_gps_begin(candidate_baud, false, &saw_any_serial_data);
                        bool old_baud_with_assume = false;
                        if (!old_baud_without_assume)
                            old_baud_with_assume = try_gps_begin(candidate_baud, true, &saw_any_serial_data);

                        if (old_baud_without_assume || old_baud_with_assume)
                        {
                            s_detected_gps_baud = candidate_baud;
                            s_gps_required_assume_success = old_baud_with_assume;

                            if (baud_change_command_reported_success && rebootIfGpsBaudChangeCommandSucceedsButImmediateReconnectFails)
                            {
#if DEBUG_ENABLED
                                ESP_LOGW(TAG, "GPS baud-rate change command to %lu was acknowledged, but immediate reconnect failed. Rebooting to complete transition.", static_cast<unsigned long>(gps_baud));
#endif
                                display_line(1, "GPS baud changed");
                                display_line(2, "Rebooting...");
                                vTaskDelay(pdMS_TO_TICKS(1000));
#if MQTT_ENABLED
                                mqtt_publish_final_report();
#endif
                                esp_restart();
                            }

#if DEBUG_ENABLED
                            ESP_LOGW(TAG, "GPS baud-rate change to %lu did not take effect immediately. Continuing at detected baud %lu.", static_cast<unsigned long>(gps_baud), static_cast<unsigned long>(candidate_baud));
#endif
                        }
                        else
                        {
#if DEBUG_ENABLED
                            ESP_LOGW(TAG, "GPS baud-rate change attempt left module unreachable at both %lu and %lu. Continuing with best-known state.", static_cast<unsigned long>(candidate_baud), static_cast<unsigned long>(gps_baud));
#endif
                        }
                    }
                }

#if DEBUG_ENABLED
                if (s_gps_required_assume_success)
                {
                    ESP_LOGW(TAG,
                             "GPS communication was established only with assume_success=true at %lu baud. The attached module may have limited u-blox compatibility.",
                             static_cast<unsigned long>(s_detected_gps_baud));
                };

                ESP_LOGI(TAG, "GPS initialization will continue at %lu baud.", static_cast<unsigned long>(s_detected_gps_baud));
#endif
                return true;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(2000));
    }

#if DEBUG_ENABLED
    if (saw_any_serial_data)
        ESP_LOGW(TAG, "GPS serial data was detected, but SparkFun u-blox GNSS v3 could not initialize the module. The module may be an older NEO-6/7/M8 variant.");
    else
        ESP_LOGW(TAG, "No GPS serial data was detected on GPIO%d/GPIO%d at any tested baud rate. Check power, TX/RX wiring, and signal levels.", RXPin, TXPin);
#endif

    return false;
}

static bool configure_gps_outputs(bool *uart1_output_set_result)
{
    bool i2c_output_disabled = s_gps.setI2COutput(0);
    bool uart1_output_set = s_gps.setUART1Output(COM_TYPE_UBX | COM_TYPE_NMEA);
    bool uart2_output_disabled = s_gps.setUART2Output(0);

    if (uart1_output_set_result != nullptr)
        *uart1_output_set_result = uart1_output_set;

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "GPS port config results: I2C off=%s, UART1 UBX=%s, UART2 off=%s",
             i2c_output_disabled ? "ok" : "failed",
             uart1_output_set ? "ok" : "failed",
             uart2_output_disabled ? "ok" : "failed");

    if (!uart2_output_disabled)
        ESP_LOGI(TAG, "UART2 output disable is not supported by this module/firmware. Continuing with UART1 configuration.");

    if (!i2c_output_disabled)
        ESP_LOGI(TAG, "I2C output disable did not succeed. This is non-fatal for UART1 operation.");

#endif

    return uart1_output_set;
}

static bool perform_extended_no_signal_recovery()
{
#if DEBUG_ENABLED
    ESP_LOGW(TAG, "Performing GPS extended no-signal recovery: factory-default + GNSS reset + reinitialization.");
#endif

    bool factory_default_applied = s_gps.factoryDefault();
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "GPS factoryDefault() -> %s", factory_default_applied ? "ok" : "failed");
#endif

    s_gps.hardReset();
    vTaskDelay(pdMS_TO_TICKS(1500));

    static constexpr int recoveryInitAttempts = 3;
    uint32_t recovery_target_baud = s_gps_target_baud > 0 ? s_gps_target_baud : get_highest_candidate_gps_baud();
    if (!set_gps_baud_rate(recovery_target_baud, recoveryInitAttempts))
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "GPS recovery reinitialization failed after reset.");
#endif
        return false;
    }

    bool uart1_output_set = false;
    bool gps_outputs_configured = configure_gps_outputs(&uart1_output_set);
    s_use_nmea_fallback = s_gps_required_assume_success || !uart1_output_set;

