roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "GPS recovery post-config: outputs=%s, fallback=%s, baud=%lu",
             gps_outputs_configured ? "ok" : "partial",
             s_use_nmea_fallback ? "enabled" : "disabled",
             static_cast<unsigned long>(s_detected_gps_baud));
#endif

    return true;
}

static void halt_with_display(const char *line1, const char *line2, const char *line3)
{
    display_line(1, line1);
    display_line(2, line2);
    display_line(3, line3);
    while (true)
        vTaskDelay(pdMS_TO_TICKS(1000));
}

static void IRAM_ATTR pps_isr_handler(void *arg)
{
    int64_t edge_us = esp_timer_get_time();
    BaseType_t higher_priority_task_woken = pdFALSE;
    if (s_pps_semaphore != nullptr)
        xSemaphoreGiveFromISR(s_pps_semaphore, &higher_priority_task_woken);
    if (s_pps_timestamp_queue != nullptr)
        xQueueOverwriteFromISR(s_pps_timestamp_queue, &edge_us, &higher_priority_task_woken);
    if (higher_priority_task_woken == pdTRUE)
        portYIELD_FROM_ISR();
}

static void setup_pps_input()
{
    gpio_config_t config{};
    config.pin_bit_mask = 1ULL << PPSPin;
    config.mode = GPIO_MODE_INPUT;
    config.pull_up_en = GPIO_PULLUP_DISABLE;
    config.pull_down_en = GPIO_PULLDOWN_DISABLE;
    config.intr_type = GPIO_INTR_POSEDGE;
    ESP_ERROR_CHECK(gpio_config(&config));

    esp_err_t err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE)
        ESP_ERROR_CHECK(err);

    ESP_ERROR_CHECK(gpio_isr_handler_add(static_cast<gpio_num_t>(PPSPin), pps_isr_handler, nullptr));
}

static void clear_pps_events() // to do
{
    while (xSemaphoreTake(s_pps_semaphore, 0) == pdTRUE)
    {
    }
}

static void pps_discipline_task(void *parameter)
{
    static constexpr int64_t ppsTimeoutUs = 3500000;
    static constexpr int64_t maxPhaseErrorUsToCorrect = 250000;
    static constexpr int64_t minCorrectionMagnitudeUs = 2;

    int64_t last_pps_us = esp_timer_get_time();
    bool logged_active = false;

    for (;;)
    {
        int64_t edge_us = 0;
        if (xQueueReceive(s_pps_timestamp_queue, &edge_us, pdMS_TO_TICKS(1000)) == pdTRUE)
        {
            last_pps_us = edge_us;
            s_pps_discipline_active.store(true);
#if MQTT_ENABLED
            s_pps_pulses.fetch_add(1);
#endif
            sync_state_note_pps_edge(edge_us);

            if (!logged_active)
            {
#if DEBUG_ENABLED
                ESP_LOGI(TAG, "PPS discipline active.");
#endif
                logged_active = true;
            }

            if (!s_time_has_been_set.load() || s_time_setting_in_progress.load())
                continue;

            if (xSemaphoreTake(s_time_mutex, pdMS_TO_TICKS(20)) != pdTRUE)
                continue;

            int64_t processing_now_us = esp_timer_get_time();
            struct timeval now{};
            gettimeofday(&now, nullptr);

            int64_t current_time_us = static_cast<int64_t>(now.tv_sec) * 1000000LL + static_cast<int64_t>(now.tv_usec);
            int64_t wake_delay_us = processing_now_us - edge_us;
            if (wake_delay_us < 0)
                wake_delay_us = 0;
            int64_t edge_time_us = current_time_us - wake_delay_us;

            int64_t phase_error_us = edge_time_us % 1000000LL;
            if (phase_error_us > 500000)
                phase_error_us -= 1000000;
            else if (phase_error_us < -500000)
                phase_error_us += 1000000;

            int64_t correction_us = -phase_error_us;
            if (llabs(correction_us) >= minCorrectionMagnitudeUs && llabs(phase_error_us) <= maxPhaseErrorUsToCorrect)
            {
                struct timeval delta{};
                delta.tv_sec = static_cast<time_t>(correction_us / 1000000LL);
                delta.tv_usec = static_cast<suseconds_t>(correction_us % 1000000LL);
                if (delta.tv_usec < 0)
                {
                    delta.tv_usec += 1000000;
                    delta.tv_sec -= 1;
                }

                if (adjtime(&delta, nullptr) == 0)
                {
                    s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
                    s_ntp_reference_valid = true;
                }
            }

            xSemaphoreGive(s_time_mutex);
        }
        else
        {
            int64_t now_us = esp_timer_get_time();
            if ((now_us - last_pps_us) > ppsTimeoutUs)
            {
                if (logged_active && DEBUG_ENABLED)
                    ESP_LOGW(TAG, "PPS discipline inactive (PPS signal unavailable).");
                logged_active = false;
                s_pps_discipline_active.store(false);
                sync_state_note_pps_timeout(now_us);
            }
        }

#if CALCULATE_PPS_DISCIPLINE_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: Specific to pps_discipline_task to get a valid result the code below needed to be running
        //         with the stack report usage display being examined when a PPS event happens (every second)
        //
        // NOTE 2: Results were taken after a minute to allow the numbers to settle in
        //
        // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //
        // Configured task stack; rerun this measurement after changing PPS processing.
        const size_t allocated_bytes = PPS_Discipline_Task_Stack_Size;

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;

