roblatour/ESP32TimeServer/main/main.cpp
    if (xSemaphoreTake(s_mqtt_stats_mutex, portMAX_DELAY) == pdTRUE)
    {
        most_requests_per_second = s_ntp_most_requests_per_second;
        s_ntp_most_requests_per_second = s_ntp_requests_this_second;

        xSemaphoreGive(s_mqtt_stats_mutex);
    }

#endif

    char publishing_date_and_time[25] = "";
    mqtt_format_time(time(nullptr), publishing_date_and_time, sizeof(publishing_date_and_time));

#if MQTT_HISTORICAL_REPORTING_ENABLED
    char last_lock[25] = "";
    char last_unlock[25] = "";
    mqtt_format_time(s_last_gnss_lock.load(), last_lock, sizeof(last_lock));
    mqtt_format_time(s_last_gnss_unlock.load(), last_unlock, sizeof(last_unlock));
#endif

    int64_t link_up_total_us = s_eth_link_up_total_us.load();
    int64_t connected_since_us = s_eth_link_connected_us.load();
    if (connected_since_us > 0)
        link_up_total_us += esp_timer_get_time() - connected_since_us;
    int64_t link_up_us = link_up_total_us - s_mqtt_last_link_up_us;
    s_mqtt_last_link_up_us = link_up_total_us;

    uint8_t satellite_min = s_satellite_min.exchange(UINT8_MAX);
    uint8_t satellite_max = s_satellite_max.exchange(0);
    if (satellite_min == UINT8_MAX)
        satellite_min = s_satellite_count.load();

    size_t len = 0;

    len += snprintf(payload + len, payload_size - len, "{");

    len += snprintf(payload + len, payload_size - len, "\"current\": {");
    len += snprintf(payload + len, payload_size - len, "\"time\":\"%s\",", publishing_date_and_time);
    len += snprintf(payload + len, payload_size - len, "\"uptime\":%lu,", (unsigned long)(esp_timer_get_time() / 1000000LL));
    len += snprintf(payload + len, payload_size - len, "\"ethernet_up\":%s,", s_ethernet_connected.load() ? "true" : "false");
    len += snprintf(payload + len, payload_size - len, "\"pps_active\":%s,", s_pps_discipline_active.load() ? "true" : "false");
    len += snprintf(payload + len, payload_size - len, "\"gnss_locked\":%s,", s_gnss_locked.load() ? "true" : "false");
    len += snprintf(payload + len, payload_size - len, "\"satellites\":%u", (unsigned int)s_satellite_count.load());

#if MQTT_MEMORY_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, ",");
    len += snprintf(payload + len, payload_size - len, "\"memory\":{");
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_8bit\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_8BIT));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_32bit\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_32BIT));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_internal\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_dma\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_DMA));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_spiram\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    len += snprintf(payload + len, payload_size - len, "\"malloc_cap_default\":%lu,", (unsigned long)heap_caps_get_free_size(MALLOC_CAP_DEFAULT));
    len += snprintf(payload + len, payload_size - len, "\"free_heap\":%lu,", (unsigned long)esp_get_free_heap_size());
    len += snprintf(payload + len, payload_size - len, "\"minimum_free_heap\":%lu,", (unsigned long)esp_get_minimum_free_heap_size());
    len += snprintf(payload + len, payload_size - len, "\"largest_free_8bit_block\":%lu", (unsigned long)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    len += snprintf(payload + len, payload_size - len, "}},");
#else
    len += snprintf(payload + len, payload_size - len, "},");
#endif

    if (MQTT_QOS > 0)
    {
        len += snprintf(payload + len, payload_size - len, "\"queued_messages\":{");
        len += snprintf(payload + len, payload_size - len, "\"held\":%lu,", (unsigned long)queued_messages);
        len += snprintf(payload + len, payload_size - len, "\"discarded\":%lu", (unsigned long)queued_messages_discarded);
        len += snprintf(payload + len, payload_size - len, "},");
    };

    len += snprintf(payload + len, payload_size - len, "\"this_period\":{");
    len += snprintf(payload + len, payload_size - len, "\"ethernet_up_secs\":%lld,", (long long)(link_up_us / 1000000LL));
    len += snprintf(payload + len, payload_size - len, "\"pps_pulses\":%lu,", (unsigned long)s_pps_pulses.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"gnss_locked_secs\":%lu,", (unsigned long)gnss_locked_seconds_this_period());
    len += snprintf(payload + len, payload_size - len, "\"satellites\":{");
    len += snprintf(payload + len, payload_size - len, "\"min\":%u,", (unsigned int)satellite_min);
    len += snprintf(payload + len, payload_size - len, "\"max\":%u", (unsigned int)satellite_max);
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"ntp\":{");
    len += snprintf(payload + len, payload_size - len, "\"requests\":{");
    len += snprintf(payload + len, payload_size - len, "\"valid\":%lu,", (unsigned long)s_ntp_valid_requests.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"invalid\":%lu,", (unsigned long)s_ntp_invalid_requests.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"max_per_second\":%lu", (unsigned long)most_requests_per_second);
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"responses\":{");
    len += snprintf(payload + len, payload_size - len, "\"gnss_lock\":%lu,", (unsigned long)s_ntp_requests_with_gnss_lock.exchange(0));
    len += snprintf(payload + len, payload_size - len, "\"gnss_unlock\":%lu", (unsigned long)s_ntp_requests_without_gnss_lock.exchange(0));
    len += snprintf(payload + len, payload_size - len, "}");

#if MQTT_CLIENT_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"clients\":[%s],", s_mqtt_clients_json);
    len += snprintf(payload + len, payload_size - len, "\"clients_overflown\":%s", s_mqtt_client_table_overflown.exchange(false) ? "true" : "false");
#else
    len += snprintf(payload + len, payload_size - len, "}");
#endif

#if MQTT_HISTORICAL_REPORTING_ENABLED
    len += snprintf(payload + len, payload_size - len, "},");
    len += snprintf(payload + len, payload_size - len, "\"historical\":{");
    len += snprintf(payload + len, payload_size - len, "\"gnss\":{");
    len += snprintf(payload + len, payload_size - len, "\"last_lock\":\"%s\",", last_lock);
    len += snprintf(payload + len, payload_size - len, "\"last_unlock\":\"%s\"", last_unlock);
    len += snprintf(payload + len, payload_size - len, "}");
#endif

    len += snprintf(payload + len, payload_size - len, "}");
    len += snprintf(payload + len, payload_size - len, "}");

