roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Published: \n\r%s", payload);
#endif
}

static void mqtt_publish_final_report()
{
    if (!s_mqtt_connected.load())
        return;

    char payload[MQTT_REPORT_SIZE] = "";
    mqtt_build_report(payload, sizeof(payload));

    s_mqtt_restart_publish_id.store(-1);
    s_mqtt_restart_publish_completed.store(false);
    int message_id = esp_mqtt_client_publish(s_mqtt_client, s_mqtt_report_topic, payload, 0, MQTT_QOS, MQTTBrokerRetain);
    if (message_id < 0)
        return;

    s_mqtt_restart_publish_id.store(message_id);
    TickType_t wait_started = xTaskGetTickCount();
    TickType_t wait_timeout = pdMS_TO_TICKS(MQTT_RESTART_PUBLISH_TIMEOUT_MS);
    while (!s_mqtt_restart_publish_completed.load() && (xTaskGetTickCount() - wait_started) < wait_timeout)
        vTaskDelay(pdMS_TO_TICKS(10));

    s_mqtt_restart_publish_id.store(-1);
}

static void mqtt_service_task(void *parameter)
{
    bool previously_connected = false;
    TickType_t next_report = xTaskGetTickCount() + pdMS_TO_TICKS(MQTTReportingPeriod * 1000UL);
    for (;;)
    {
        bool connected = s_mqtt_connected.load();
        if (connected && !previously_connected)
            esp_mqtt_client_publish(s_mqtt_client, s_mqtt_status_topic, "online", 0, MQTT_QOS, 1);
        previously_connected = connected;

        if (connected && s_mqtt_queued_messages_count.load() > 0)
            mqtt_send_queued_messages();

        if (xTaskGetTickCount() >= next_report)
        {
            mqtt_build_report(s_mqtt_payload, sizeof(s_mqtt_payload));
            if (!mqtt_publish_report(s_mqtt_payload))
                mqtt_enqueue_report(s_mqtt_payload);
            next_report += pdMS_TO_TICKS(MQTTReportingPeriod * 1000UL);
        }
        vTaskDelay(pdMS_TO_TICKS(MQTT_QUEUED_PUBLISH_DELAY_MS));

#if CALCULATE_MQTT_SERVICE_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 22000; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("mqtt_service_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing:
        // mqtt_service_task: Stack report: Allocated=22000 bytes, HighWater=19976 bytes unused, PeakUsage=2024 bytes, Suggested=2530 bytes

#endif
    }
}

static void mqtt_log_tf_directory(const char *path)
{
#if DEBUG_ENABLED
    DIR *directory = opendir(path);
    if (directory == nullptr)
        return;
    dirent *entry = nullptr;
    while ((entry = readdir(directory)) != nullptr)
    {
        if (strcmp(entry->d_name, ".") == 0 || strcmp(entry->d_name, "..") == 0)
            continue;
        std::string child_path = std::string(path) + "/" + entry->d_name;
        struct stat information{};
        if (stat(child_path.c_str(), &information) != 0)
            continue;
        ESP_LOGI(TAG, "%s", child_path.c_str());
        if (S_ISDIR(information.st_mode))
            mqtt_log_tf_directory(child_path.c_str());
    }
    closedir(directory);
#else
    (void)path;
#endif
}

#endif

static void setup_mqtt_tf_queue()
{

#if MQTT_ENABLED

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    sd_pwr_ctrl_ldo_config_t ldo_config{};
    ldo_config.ldo_chan_id = 4;
    sd_pwr_ctrl_handle_t power_control = nullptr;
    esp_err_t result = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &power_control);
    if (result != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Unable to enable TF card power: %s. Queued MQTT messages will be stored in ram.", esp_err_to_name(result));
#endif
        return;
    }
    host.pwr_ctrl_handle = power_control;
    auto cleanup_power_control = [&power_control]()
    {
        if (power_control != nullptr)
        {
            sd_pwr_ctrl_del_on_chip_ldo(power_control);
            power_control = nullptr;
        }
    };

    sdmmc_slot_config_t slot = SDMMC_SLOT_CONFIG_DEFAULT();
    slot.width = 4;
    slot.clk = static_cast<gpio_num_t>(TFCardClockPin);
    slot.cmd = static_cast<gpio_num_t>(TFCardCommandPin);
    slot.d0 = static_cast<gpio_num_t>(TFCardData0Pin);
    slot.d1 = static_cast<gpio_num_t>(TFCardData1Pin);
    slot.d2 = static_cast<gpio_num_t>(TFCardData2Pin);
    slot.d3 = static_cast<gpio_num_t>(TFCardData3Pin);
    slot.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;
    esp_vfs_fat_mount_config_t mount_config{};
    mount_config.format_if_mount_failed = false;
    mount_config.max_files = 4;
    mount_config.allocation_unit_size = 16 * 1024;

    result = esp_vfs_fat_sdmmc_mount(TF_MOUNT_POINT, &host, &slot, &mount_config, &s_tf_card);
    if (result != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card unavailable: %s. Queued MQTT messages will be stored in ram.", esp_err_to_name(result));
#endif
        cleanup_power_control();
        return;
    }

    FATFS *filesystem = nullptr;
    DWORD free_clusters = 0;
    if (f_getfree("0:", &free_clusters, &filesystem) != FR_OK || filesystem == nullptr || filesystem->fs_type != FS_FAT32)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card is not FAT32. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }

    mqtt_log_tf_directory(TF_MOUNT_POINT);
    bool queue_directory_created = mkdir(TF_QUEUE_DIRECTORY, 0775) == 0;
    if (!queue_directory_created && errno != EEXIST)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "Unable to create TF MQTT queue directory. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }
#if DEBUG_ENABLED
    if (queue_directory_created)
        ESP_LOGI(TAG, "%s", TF_QUEUE_DIRECTORY);
#endif

    char probe_path[128] = "";
    snprintf(probe_path, sizeof(probe_path), "%s/PROBE.TMP", TF_QUEUE_DIRECTORY);
    FILE *probe = fopen(probe_path, "wb+");
    char probe_value = 0;
    bool usable = probe != nullptr && fwrite("T", 1, 1, probe) == 1 && fflush(probe) == 0 &&
                  fseek(probe, 0, SEEK_SET) == 0 && fread(&probe_value, 1, 1, probe) == 1 && probe_value == 'T';
    if (probe != nullptr)
        fclose(probe);
    unlink(probe_path);
    if (!usable)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "TF card read/write verification failed. Queued MQTT messages will be stored in ram.");
#endif
        esp_vfs_fat_sdcard_unmount(TF_MOUNT_POINT, s_tf_card);
        s_tf_card = nullptr;
        cleanup_power_control();
        return;
    }

    std::vector<std::string> files = mqtt_tf_queue_files();
    for (const std::string &path : files)
    {
        unsigned long high = 0;
        unsigned long low = 0;
        if (sscanf(path.c_str(), "/tfcard/Queue/R%7lX.%3lX", &high, &low) == 2)
        {
            uint64_t sequence = (static_cast<uint64_t>(high) << 12) | low;
            if (sequence >= s_tf_queue_next_sequence)
                s_tf_queue_next_sequence = sequence + 1;
        }
    }
    s_mqtt_queued_messages_count.store(files.size());
    s_tf_queue_available.store(true);
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "TF card MQTT queue enabled");
    if (files.empty())
        ESP_LOGI(TAG, "No queued messages found");
#endif

#endif
}

