roblatour/ESP32TimeServer/main/main.cpp
    if (!ETH.config(local_ip, gateway, subnet, dns1, dns2))
    {
        ESP_LOGE(TAG, "ETH.config() failed to apply the static IP configuration");
        return false;
    }

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Static IP configuration applied: ip=%s, mask=%s, gw=%s",
             StaticIPAddress, SubnetMask, Gateway);
#endif
    return true;
}

static void setup_ethernet()
{
    if (s_net_event_group == nullptr)
        s_net_event_group = xEventGroupCreate();

    s_ip_address[0] = '\0';
    s_ipv4_address[0] = '\0';
    s_ipv6_address[0] = '\0';
    xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT);

    Network.onEvent(arduino_eth_event_handler);

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Starting Arduino Ethernet with phy_addr=%d, mdc=%d, mdio=%d, power=%d",
             ETH_PHY_ADDRESS,
             static_cast<int>(ETH_MDC_GPIO),
             static_cast<int>(ETH_MDIO_GPIO),
             static_cast<int>(ETH_PHY_RST_GPIO));
#endif

    if (!ETH.enableIPv6())
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to enable Ethernet IPv6 support");
#endif
    }

    if (!ETH.begin(ETH_PHY_IP101,
                   ETH_PHY_ADDRESS,
                   static_cast<int>(ETH_MDC_GPIO),
                   static_cast<int>(ETH_MDIO_GPIO),
                   static_cast<int>(ETH_PHY_RST_GPIO),
                   EMAC_CLK_EXT_IN))
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "ETH.begin() failed");
#endif
        return;
    }

    // Apply the optional static IP address (if configured). When StaticIPAddress is
    // left empty this is a no-op and DHCP is used as usual.
    bool static_ip_applied = configure_static_ip();

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Waiting for Ethernet %s address...",
             static_ip_applied ? "static" : "DHCP");
#endif
    xEventGroupWaitBits(s_net_event_group, ETH_GOT_IP_BIT | ETH_GOT_IP6_BIT, pdFALSE, pdFALSE, portMAX_DELAY);
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Ethernet setup complete, current address: %s", s_ip_address[0] == '\0' ? "<none>" : s_ip_address);
#endif
}

void write_opening_messages_to_the_console()
{

    Serial.begin(serialMonitorSpeed);
    vTaskDelay(pdMS_TO_TICKS(100));

#if DEBUG_ENABLED
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "******************* Application Startup *******************");
    ESP_LOGI(TAG, "ESP32 Time Server v2.6");

#if UPTIME_RESTART_BUTTON_ENABLED
    ESP_LOGI(TAG, "Uptime / Reset button support is enabled in the settings");
#else
    ESP_LOGW(TAG, "Uptime / Reset button support is disabled in the settings");
#endif

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    ESP_LOGI(TAG, "LCD support is enabled in the settings");
#else
    ESP_LOGW(TAG, "LCD support is disabled in the settings");
#endif

#if OTE_UPDATES_ENABLED
    ESP_LOGI(TAG, "Over the Ethernet update support is enabled in the settings");
#else
    ESP_LOGW(TAG, "Over the Ethernet update support is disabled in the settings");
#endif

#if MQTT_ENABLED
    ESP_LOGI(TAG, "MQTT is enabled in the settings");

#if MQTT_CLIENT_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT client reporting is enabled in the settings");
#else
    ESP_LOGW(TAG, "MQTT client reporting is disabled in the settings");
#endif

#if MQTT_MEMORY_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT memory reporting is enabled in the settings");
#else
    ESP_LOGW(TAG, "MQTT memory reporting is disabled in the settings");
#endif

#if MQTT_HISTORICAL_REPORTING_ENABLED
    ESP_LOGI(TAG, "MQTT historical reporting is enabled in the settings");
#else
    ESP_LOGW(TAG, "MQTT historical reporting is disabled in the settings");
#endif

#else
    ESP_LOGW(TAG, "MQTT support is disabled in the settings");
#endif

#endif
}

void setup_NVM_storage(void)
{

    if (!initialize_nvs_storage())
        ESP_LOGE(TAG, "NVS initialization failed. GPS module settings persistence is unavailable.");
}

void create_mutexes_and_semaphores(void)
{

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    s_lcd_mutex = xSemaphoreCreateMutex();
#endif
    s_time_mutex = xSemaphoreCreateMutex();
    s_pps_semaphore = xSemaphoreCreateBinary();
    s_pps_timestamp_queue = xQueueCreate(1, sizeof(int64_t));
    s_ote_mutex = xSemaphoreCreateMutex();
    s_sync_state_mutex = xSemaphoreCreateMutex();
}

void initialize_the_display(void)
{

#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    if (setup_lcd() == ESP_OK)
    {
        display_line(0, "ESP32 Time Server");
        display_line(1, "");
        display_line(2, "");
        display_line(3, "");
    }
    else
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "LCD setup failed");
#endif
    }
#endif
}

static void setup_up_time_button()
{

#if UPTIME_RESTART_BUTTON_ENABLED
    gpio_config_t config{};
    config.pin_bit_mask = 1ULL << upTimeRestartPin;
    config.mode = GPIO_MODE_INPUT;
    config.pull_up_en = GPIO_PULLUP_ENABLE;
    config.pull_down_en = GPIO_PULLDOWN_DISABLE;
    config.intr_type = GPIO_INTR_DISABLE;
    ESP_ERROR_CHECK(gpio_config(&config));

#endif
}

static void configure_mac_address()
{

    uint8_t real_mac_address[6];
    char real_mac_address_str[18];

    esp_err_t ret = esp_efuse_mac_get_default(real_mac_address);

    if (ret == ESP_OK)
    {
        std::snprintf(real_mac_address_str, sizeof(real_mac_address_str),
                      "%02x:%02x:%02x:%02x:%02x:%02x",
                      real_mac_address[0], real_mac_address[1], real_mac_address[2],
                      real_mac_address[3], real_mac_address[4], real_mac_address[5]);
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "Real MAC address for this ESP32 is: %s", real_mac_address_str);
#endif
    }
#if DEBUG_ENABLED
    else
    {
        ESP_LOGE(TAG, "Failed to get the MAC address for this ESP32. Error: %d", ret);
    }
#endif

    if ((MACAddress[0] == '\0') || (std::strcmp(real_mac_address_str, MACAddress) == 0))
    {
#if DEBUG_ENABLED
        ESP_LOGI(TAG, "No need to change the MAC address.");
#endif
        return;
    }

    uint8_t mac[6] = {};
    if (!parse_mac_id_string(MACAddress, mac))
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "The MAC address is settings is invalid: %s - the MAC ID will not be changed", MACAddress);
#endif
        return;
    }

    esp_err_t err = esp_base_mac_addr_set(mac);
    if (err != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Failed to set MAC address to %s: %s", MACAddress, esp_err_to_name(err));
#endif
        return;
    }
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "MAC address changed to : %s", MACAddress);
#endif
}

void setup_ethernet_connection()
{

    configure_mac_address();

