roblatour/ESP32TimeServer/main/main.cpp
    display_line(1, "Connecting Ethernet");
    display_line(2, "");
    setup_ethernet();
    display_selected_ip_address(static_cast<int>(time(nullptr) % 10));
}

#if OTE_UPDATES_ENABLED

static void OTE_copy_reason(char *destination, size_t destination_size, const char *reason)
{
    if (destination_size == 0)
        return;

    if (reason == nullptr || reason[0] == '\0')
    {
        destination[0] = '\0';
        return;
    }

    snprintf(destination, destination_size, "%s", reason);
}

static void OTE_set_running_state(unsigned int progress, unsigned int total)
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = true;
        s_ote_failed = false;
        s_ote_success = false;
        s_ote_failure_display_until_us = 0;
        s_ote_reboot_at_us = 0;
        s_ote_error_reason[0] = '\0';
        s_ote_progress_percent = total == 0 ? 0 : static_cast<int>((progress * 100U) / total);
        xSemaphoreGive(s_ote_mutex);
    }
}

static void OTE_set_failure_state(const char *reason)
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = false;
        s_ote_failed = true;
        s_ote_success = false;
        s_ote_failure_display_until_us = esp_timer_get_time() + static_cast<int64_t>(OTE_Failure_Display_Time_Ms) * 1000LL;
        s_ote_reboot_at_us = 0;
        OTE_copy_reason(s_ote_error_reason, sizeof(s_ote_error_reason), reason);
        xSemaphoreGive(s_ote_mutex);
    }
}

static void OTE_set_success_state()
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = false;
        s_ote_failed = false;
        s_ote_success = true;
        s_ote_progress_percent = 100;
        s_ote_failure_display_until_us = 0;
        s_ote_reboot_at_us = esp_timer_get_time() + static_cast<int64_t>(OTE_Reboot_Delay_Ms) * 1000LL;
        s_ote_error_reason[0] = '\0';
        xSemaphoreGive(s_ote_mutex);
    }
}

static void format_ote_error_reason(ota_error_t error, char *buffer, size_t buffer_size)
{
    const char *update_error = Update.errorString();
    if ((error == OTA_BEGIN_ERROR || error == OTA_END_ERROR) && update_error != nullptr && strcmp(update_error, "No Error") != 0)
    {
        snprintf(buffer, buffer_size, "%s", update_error);
        return;
    }

    switch (error)
    {
    case OTA_AUTH_ERROR:
        snprintf(buffer, buffer_size, "%s", "Auth Failed");
        break;
    case OTA_BEGIN_ERROR:
        snprintf(buffer, buffer_size, "%s", "Begin Failed");
        break;
    case OTA_CONNECT_ERROR:
        snprintf(buffer, buffer_size, "%s", "Connect Failed");
        break;
    case OTA_RECEIVE_ERROR:
        snprintf(buffer, buffer_size, "%s", "Receive Failed");
        break;
    case OTA_END_ERROR:
        snprintf(buffer, buffer_size, "%s", "End Failed");
        break;
    default:
        snprintf(buffer, buffer_size, "%s", "Unknown Error");
        break;
    }
}

static bool render_ote_display()
{
    bool OTE_in_progress = false;
    bool OTE_failed = false;
    bool OTE_success = false;
    int OTE_progress_percent = -1;
    int64_t OTE_failure_display_until_us = 0;
    int64_t OTE_reboot_at_us = 0;
    char ote_error_reason[lcdColumns + 1] = "";

    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) != pdTRUE)
        return false;

    OTE_in_progress = s_ote_in_progress;
    OTE_failed = s_ote_failed;
    OTE_success = s_ote_success;
    OTE_progress_percent = s_ote_progress_percent;
    OTE_failure_display_until_us = s_ote_failure_display_until_us;
    OTE_reboot_at_us = s_ote_reboot_at_us;
    OTE_copy_reason(ote_error_reason, sizeof(ote_error_reason), s_ote_error_reason);
    xSemaphoreGive(s_ote_mutex);

    int64_t now_us = esp_timer_get_time();
    if (!OTE_in_progress && !OTE_failed && !OTE_success)
        return false;

    if (OTE_failed && OTE_failure_display_until_us > 0 && now_us >= OTE_failure_display_until_us)
    {
        if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
        {
            s_ote_failed = false;
            s_ote_progress_percent = -1;
            s_ote_error_reason[0] = '\0';
            s_ote_failure_display_until_us = 0;
            xSemaphoreGive(s_ote_mutex);
        }
        return false;
    }

    if (OTE_in_progress)
    {
        char progress_line[lcdColumns + 1];
        snprintf(progress_line, sizeof(progress_line), "%d%% complete", OTE_progress_percent < 0 ? 0 : OTE_progress_percent);
        display_line(1, "OTE update started");
        display_line(2, progress_line);
        display_line(3, "Uploading firmware");
        return true;
    }

    if (OTE_success)
    {
        (void)OTE_reboot_at_us;
        display_line(1, "OTE successful");
        display_line(2, "100% complete");
        display_line(3, "Rebooting in 5 sec");
        return true;
    }

    display_line(1, "OTE failed");
    display_line(2, ote_error_reason[0] == '\0' ? "Unknown reason" : ote_error_reason);
    display_line(3, "Resuming in 10 sec");
    return true;
}

static void ote_service_task(void *parameter)
{
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "OTE service task started on port %u", static_cast<unsigned int>(OTEPort));
#endif

    // uint32_t last_heartbeat_ms = 0;   // uncomment this line and the block below if you want to see a heart beat message in the console log every 10 seconds

    for (;;)
    {
        ArduinoOTA.handle();

        // uncomment the following if you want to see a heart beat message in the console log every 10 seconds
        /*
        uint32_t now_ms = millis();
        if (last_heartbeat_ms == 0 || (now_ms - last_heartbeat_ms) >= 10000UL)
        {

            #if DEBUG_ENABLED
                ESP_LOGI(TAG,
                         "OTE heartbeat: online=%s, ip=%s, in_progress=%s",
                         Network.isOnline() ? "true" : "false",
                         s_ip_address[0] == '\0' ? "<none>" : s_ip_address,
                         s_ote_in_progress ? "true" : "false");

            last_heartbeat_ms = now_ms;
        }
        */

        bool should_reboot = false;
        TickType_t loop_delay_ticks = pdMS_TO_TICKS(50);
        if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
        {
            bool OTE_idle = !s_ote_in_progress && !s_ote_failed && !s_ote_success;
            if (OTE_idle)
                loop_delay_ticks = pdMS_TO_TICKS(200);

            if (s_ote_success && s_ote_reboot_at_us > 0 && esp_timer_get_time() >= s_ote_reboot_at_us)
                should_reboot = true;
            xSemaphoreGive(s_ote_mutex);
        }

        vTaskDelay(loop_delay_ticks);
        if (should_reboot)
        {
#if MQTT_ENABLED
            mqtt_publish_final_report();
#endif
            esp_restart();
        }

#if CALCULATE_OTE_SERVICE_TASK_STACK_SIZE_ENABLED

