roblatour/ESP32TimeServer/main/main.cpp
        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: Specific to ote_service_task to get a valid result the code below needed to be running
        //         with the stack report usage display being examined when an OTE update was underway
        //
        // NOTE 2: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("ote_service_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing:
        // ote_service_task: Stack report: Allocated=16384 bytes, HighWater=13536 bytes unused, PeakUsage=2848 bytes, Suggested=3560 bytes

#endif
    }
}

static void setup_ota()
{
    if (xSemaphoreTake(s_ote_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ote_in_progress = false;
        s_ote_failed = false;
        s_ote_success = false;
        s_ote_progress_percent = -1;
        s_ote_failure_display_until_us = 0;
        s_ote_reboot_at_us = 0;
        s_ote_error_reason[0] = '\0';
        xSemaphoreGive(s_ote_mutex);
    };

    bool network_begin_ok = Network.begin();

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "Arduino Network.begin()=%s, online=%s, current_ip=%s",
             network_begin_ok ? "true" : "false",
             Network.isOnline() ? "true" : "false",
             s_ip_address[0] == '\0' ? "<none>" : s_ip_address);

    ESP_LOGI(TAG,
             "Configuring ArduinoOTA: host=%s, port=%u, password_length=%u",
             DeviceName,
             static_cast<unsigned int>(OTEPort),
             static_cast<unsigned int>(strlen(OTEPassword)));
#endif

    ArduinoOTA.setPort(OTEPort);
    ArduinoOTA.setHostname(DeviceName);
    ArduinoOTA.setPassword(OTEPassword);
    ArduinoOTA.setRebootOnSuccess(false);
    ArduinoOTA.onStart([]()
                       {
                           OTE_set_running_state(0, 1);
#if DEBUG_ENABLED
                           ESP_LOGI(TAG, "OTE update started");
#endif
                       });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                          { OTE_set_running_state(progress, total); });
    ArduinoOTA.onEnd([]()
                     {
                         OTE_set_success_state();
#if DEBUG_ENABLED
                         ESP_LOGI(TAG, "OTE update completed successfully");
#endif
                     });
    ArduinoOTA.onError([](ota_error_t error)
                       {
                           char reason[lcdColumns + 1];
                           format_ote_error_reason(error, reason, sizeof(reason));
                           OTE_set_failure_state(reason);
#if DEBUG_ENABLED
                           ESP_LOGE(TAG, "OTE update failed: %s", reason);
#endif
                       });
#if DEBUG_ENABLED
    ESP_LOGI(TAG, "Calling ArduinoOTA.begin()...");
#endif

    ArduinoOTA.begin();

#if DEBUG_ENABLED
    ESP_LOGI(TAG,
             "ArduinoOTA.begin() returned, listener should be available on %s:%u",
             s_ip_address[0] == '\0' ? DeviceName : s_ip_address,
             static_cast<unsigned int>(OTEPort));
#endif
}

#endif

void setup_for_ote_updates()
{
#if OTE_UPDATES_ENABLED

    display_line(1, "Setup OTE");
    display_line(2, "");
    setup_ota();

    // note: this task is intentionally pinned to core 0 (as opposed to tskNO_AFFINITY)
    xTaskCreatePinnedToCore(ote_service_task, "ote_service", 3560, nullptr, 5, nullptr, 0);

#endif
}

static bool acquire_sync_candidate(sync_candidate_t *candidate)
{
    if (candidate == nullptr)
        return false;

    *candidate = sync_candidate_t{};
    candidate->used_nmea_fallback = s_use_nmea_fallback;
    candidate->pps_release_time_us = esp_timer_get_time();
    int64_t attempt_start_us = candidate->pps_release_time_us;

    if (s_use_nmea_fallback)
    {
        nmea_rmc_time_t nmea_time{};
        if (!wait_for_nmea_rmc_time(&nmea_time, 3000UL))
        {
            candidate->failure = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid checkpoint 1.");
#endif
            return false;
        }

        candidate->candidate_time = epoch_from_utc(nmea_time.year, nmea_time.month, nmea_time.day, nmea_time.hour, nmea_time.minute, nmea_time.second);

        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) == pdTRUE)
        {
            candidate->use_pps_alignment = true;
            candidate->pps_release_time_us = esp_timer_get_time();
            candidate->candidate_time += 1;
        }
        else
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "NMEA fallback is running without PPS.");
#endif
            if (!allowFallbackProcessingWithoutPPS)
            {
                candidate->failure = sync_fault_t::pps_missing;
                return false;
            }

            candidate->pps_release_time_us = esp_timer_get_time();
        }
    }
    else
    {
        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) != pdTRUE)
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "UBX mode is running without PPS.");
#endif

