roblatour/ESP32TimeServer/main/main.cpp
            candidate->failure = sync_fault_t::pps_missing;
            if (allowFallbackProcessingWithoutPPS)
            {
#if DEBUG_ENABLED
                ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
#endif
                s_use_nmea_fallback = true;
            }
            return false;
        }

        if (!s_gps.getPVT())
        {
            candidate->failure = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - Position - Velocity - Time");
#endif
            return false;
        }

        uint8_t fix_type = s_gps.getFixType();
        if ((fix_type != 3 && fix_type != 4 && fix_type != 5) || !s_gps.getGnssFixOk() || !s_gps.getDateValid() || !s_gps.getTimeValid())
        {
            candidate->failure = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - Fix type.");
#endif
            return false;
        }

        int year = s_gps.getYear();
        int month = s_gps.getMonth();
        int day = s_gps.getDay();
        int hour = s_gps.getHour();
        int minute = s_gps.getMinute();
        int second = s_gps.getSecond();

        if (year <= 2025 || month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 || hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 60)
        {
            candidate->failure = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "GNSS invalid - bad date or time.");
#endif
            return false;
        }

        candidate->candidate_time = epoch_from_utc(year, month, day, hour, minute, second) + 1;

        vTaskDelay(pdMS_TO_TICKS(200));

        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) != pdTRUE)
        {
#if DEBUG_ENABLED
            ESP_LOGE(TAG, "UBX mode lost PPS alignment pulse.");
#endif

            candidate->failure = sync_fault_t::pps_missing;
            if (allowFallbackProcessingWithoutPPS)
            {
#if DEBUG_ENABLED
                ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
#endif
                s_use_nmea_fallback = true;
            }
            return false;
        }

        candidate->pps_release_time_us = esp_timer_get_time();
        candidate->use_pps_alignment = true;
    }

    if ((esp_timer_get_time() - attempt_start_us) > Max_Sync_Attempt_Us)
    {
        candidate->failure = sync_fault_t::gps_invalid;
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "GNSS invalid checkpoint 2.");
#endif
        return false;
    }

    candidate->used_nmea_fallback = s_use_nmea_fallback;
    return true;
}

static void gps_runtime_recovery_task(void *parameter)
{
    TaskHandle_t sync_task_handle = reinterpret_cast<TaskHandle_t>(parameter);

    setup_gps();

#if CALCULATE_GPS_RECOVERY_TASK_STACK_SIZE_ENABLED
    // Configured recovery stack; run with a forced runtime recovery to measure the complete path.
    UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(nullptr);
    size_t high_watermark_bytes = static_cast<size_t>(high_watermark_words) * sizeof(StackType_t);
    size_t peak_usage_bytes = GPS_Recovery_Task_Stack_Size > high_watermark_bytes ? GPS_Recovery_Task_Stack_Size - high_watermark_bytes : 0;
    size_t suggested_bytes = static_cast<size_t>(static_cast<double>(peak_usage_bytes) * 1.25);
#if DEBUG_ENABLED
    ESP_LOGI("gps_recovery_task",
             "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
             static_cast<unsigned int>(GPS_Recovery_Task_Stack_Size),
             static_cast<unsigned int>(high_watermark_bytes),
             static_cast<unsigned int>(peak_usage_bytes),
             static_cast<unsigned int>(suggested_bytes));
#endif
#endif

    s_gps_recovery_in_progress.store(false);
    xTaskNotifyGive(sync_task_handle);
    vTaskDelete(nullptr);
}

static void handle_runtime_sync_failure(sync_fault_t fault, time_t update_delta, uint32_t retry_delay_ms)
{
    uint32_t failure_count = sync_state_note_failure(fault, update_delta);
    sync_state_t snapshot = get_sync_state_snapshot();

    s_time_setting_in_progress.store(false);

    if (failure_count >= Sync_Failures_Before_Runtime_Recovery && (failure_count % Sync_Failures_Before_Runtime_Recovery) == 0)
    {
        int64_t now_us = esp_timer_get_time();
        int64_t last_recovery_us = s_last_gps_recovery_us.load();
        bool recovery_due = last_recovery_us == 0 || (now_us - last_recovery_us) >= Runtime_Gps_Recovery_Min_Interval_Us;

        if (recovery_due && !s_gps_recovery_in_progress.exchange(true))
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "Runtime GPS recovery attempt after %lu consecutive sync failures.", static_cast<unsigned long>(failure_count));
#endif
            s_last_gps_recovery_us.store(now_us);
            TaskHandle_t sync_task_handle = xTaskGetCurrentTaskHandle();
            BaseType_t created = xTaskCreatePinnedToCore(gps_runtime_recovery_task,
                                                         "gps_recovery",
                                                         GPS_Recovery_Task_Stack_Size,
                                                         sync_task_handle,
                                                         15,
                                                         nullptr,
                                                         tskNO_AFFINITY);
            if (created == pdPASS)
            {
                ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                sync_state_reset_failure_counters();
            }
            else
            {
                s_gps_recovery_in_progress.store(false);
#if DEBUG_ENABLED
                ESP_LOGE(TAG, "Unable to create the GPS recovery task.");
#endif
            }
        }
    }

    if (snapshot.last_successful_sync_us > 0 && (esp_timer_get_time() - snapshot.last_successful_sync_us) > Sync_Reboot_After_Us)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Rebooting after extended holdover without a successful GPS resync.");
#endif
        vTaskDelay(pdMS_TO_TICKS(200));
#if MQTT_ENABLED
        mqtt_publish_final_report();
#endif
        esp_restart();
    }

    vTaskDelay(pdMS_TO_TICKS(retry_delay_ms));
}

static void gps_time_sync_task(void *parameter)
{
    bool first_sync = true;

    for (;;)
    {

        s_time_setting_in_progress.store(true);
        sync_state_note_attempt();

        sync_candidate_t candidate{};
        if (!acquire_sync_candidate(&candidate))
        {
            handle_runtime_sync_failure(candidate.failure, 0, 1000);
            continue;
        }

        if (first_sync)
        {
            sync_candidate_t confirmation_candidate{};
            if (!acquire_sync_candidate(&confirmation_candidate))
            {
                handle_runtime_sync_failure(confirmation_candidate.failure, 0, 1000);
                continue;
            }

            if (!first_sync_candidates_are_plausible(candidate, confirmation_candidate))
            {
                handle_runtime_sync_failure(sync_fault_t::gps_invalid, 0, 1000);
                continue;
            }

            candidate = confirmation_candidate;
        }

        time_t update_delta = 0;
        if (!first_sync)
        {
            time_t current_time = time(nullptr);
            update_delta = current_time - candidate.candidate_time;
            bool sanity_check_passed = (update_delta >= -safeguardThresholdInSeconds) && (update_delta <= safeguardThresholdInSeconds);
            if (!sanity_check_passed)
            {
                uint32_t sanity_failure_count = sync_state_note_sanity_retry(update_delta);
                s_time_setting_in_progress.store(false);

