roblatour/ESP32TimeServer/main/main.cpp
#if DEBUG_ENABLED
                ESP_LOGE(TAG, "Sanity check failed with delta %lld on attempt %lu.", static_cast<long long>(update_delta), static_cast<unsigned long>(sanity_failure_count));
#endif

                if (sanity_failure_count < Sanity_Failures_Before_Fault)
                {
                    vTaskDelay(pdMS_TO_TICKS(250));
                    continue;
                }

                s_safe_guard_tripped.store(true);
                sync_state_note_failure(sync_fault_t::sanity_mismatch, update_delta);

                if (rebootIfSanityCheckFails)
                {
#if DEBUG_ENABLED
                    ESP_LOGE(TAG, "Restarting according to settings.");
#endif
                    vTaskDelay(pdMS_TO_TICKS(200));
#if MQTT_ENABLED
                    mqtt_publish_final_report();
#endif
                    esp_restart();
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
                continue;
            }
        }

        sync_state_clear_sanity_failures();

        if (xSemaphoreTake(s_time_mutex, portMAX_DELAY) == pdTRUE)
        {
            int64_t elapsed_us = candidate.use_pps_alignment ? (esp_timer_get_time() - candidate.pps_release_time_us) : 0;
            if (elapsed_us < 0)
                elapsed_us = 0;

            struct timeval tv{};
            tv.tv_sec = candidate.candidate_time + static_cast<time_t>(elapsed_us / 1000000LL);
            tv.tv_usec = static_cast<suseconds_t>(elapsed_us % 1000000LL);
            settimeofday(&tv, nullptr);
            s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
            s_ntp_reference_valid = true;

            xSemaphoreGive(s_time_mutex);

            s_safe_guard_tripped.store(false);
            s_time_setting_in_progress.store(false);
            s_time_has_been_set.store(true);
            first_sync = false;
            sync_state_note_success(update_delta);

            if (s_attempt_no_signal_recovery)
            {
                bool save_recovery_setting_ok = save_attempt_no_signal_recovery_setting(false);
                s_attempt_no_signal_recovery = false;
#if DEBUG_ENABLED
                ESP_LOGI(TAG, "GPS time set succeeded; no-signal recovery is now persisted as false (save=%s)", save_recovery_setting_ok ? "ok" : "failed");
#endif
            }

#if DEBUG_ENABLED
            char date_string[16] = "";
            char time_string[24] = "";
            time_t now_utc = time(nullptr);
            format_local_date_time(now_utc, date_string, sizeof(date_string), time_string, sizeof(time_string));

            if (candidate.used_nmea_fallback)
                ESP_LOGI(TAG, "GPS time sync ( using NMEA fallback %s ) on %s at %s", candidate.use_pps_alignment ? "with PPS alignment" : "without PPS alignment", date_string, time_string);
            else
                ESP_LOGI(TAG, "GPS time sync on %s at %s", date_string, time_string);
#endif

            uint32_t refresh_start_ms = millis();
            uint32_t refresh_interval_ms = periodicGPSRefreshEveryThisNumberOfMinutes * 60UL * 1000UL;
            int64_t invalid_started_us = 0;

            while ((millis() - refresh_start_ms) < refresh_interval_ms)
            {
                bool gnss_valid = current_gnss_timing_is_valid();

                if (gnss_valid)
                {
                    invalid_started_us = 0;
                    sync_state_note_gnss_validity(true);
                }
                else
                {
                    if (invalid_started_us == 0)
                        invalid_started_us = esp_timer_get_time();

                    if ((esp_timer_get_time() - invalid_started_us) >= Gnss_Invalid_Reacquisition_After_Us)
                    {
                        sync_state_note_gnss_validity(false);

#if DEBUG_ENABLED
                        ESP_LOGW(TAG,
                                 "GNSS timing invalid for more than %lu seconds; starting reacquisition.",
                                 static_cast<unsigned long>(Gnss_Invalid_Reacquisition_After_Us / 1000000LL));
#endif

                        break;
                    }
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }

#if CALCULATE_GPS_TIME_SYNC_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        //
        // NOTE 1: Specific to gps_time_sync_task to get a valid result the code below needed to be running
        //         with the stack report usage display being examined when gnss task sync happens
        //
        // NOTE 2: Results were taken after a minute to allow the numbers to settle in
        //
        // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // Configured task stack; rerun this measurement after changing sync or recovery handling.
        const size_t allocated_bytes = GPS_Time_Sync_Task_Stack_Size;

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;

        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("gps_time_sync_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing (when a PPS event was underway):
        // gps_time_sync_task: Stack report: Allocated=22000 bytes, HighWater=20108 bytes unused, PeakUsage=1892 bytes, Suggested=2365 bytes

#endif
    }
}

void setup_the_gps()
{

    display_line(1, "GPS setup underway");
    display_line(2, "");

    apply_timezone_settings();

    setup_gps();

    display_line(1, "Getting date & time");
    display_line(2, "");

    xTaskCreatePinnedToCore(gps_time_sync_task, "gps_time_sync", GPS_Time_Sync_Task_Stack_Size, nullptr, 15, nullptr, tskNO_AFFINITY);

    xTaskCreatePinnedToCore(pps_discipline_task, "pps_discipline", PPS_Discipline_Task_Stack_Size, nullptr, 14, nullptr, tskNO_AFFINITY);

    while (!s_time_has_been_set.load())
        vTaskDelay(pdMS_TO_TICKS(100));

    display_line(1, "Time Synchronized");
    display_line(2, "PPS Disciplined");
}

static void ntp_server_task(void *parameter)
{
    int ipv4_socket = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    int ipv6_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDP);
    int ipv6_link_local_socket = socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDP);
    if (ipv4_socket < 0 || ipv6_socket < 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to create NTP UDP sockets: errno %d", errno);
#endif
        if (ipv4_socket >= 0)
            closesocket(ipv4_socket);
        if (ipv6_socket >= 0)
            closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    struct sockaddr_in ipv4_listen_addr{};
    ipv4_listen_addr.sin_family = AF_INET;
    ipv4_listen_addr.sin_port = htons(NTP_PORT);
    ipv4_listen_addr.sin_addr.s_addr = htonl(INADDR_ANY);

    int ipv6_only = 1;
    int reuse_address = 1;
    if (setsockopt(ipv6_socket, IPPROTO_IPV6, IPV6_V6ONLY, &ipv6_only, sizeof(ipv6_only)) != 0 ||
        setsockopt(ipv6_socket, SOL_SOCKET, SO_REUSEADDR, &reuse_address, sizeof(reuse_address)) != 0 ||
        bind(ipv4_socket, reinterpret_cast<struct sockaddr *>(&ipv4_listen_addr), sizeof(ipv4_listen_addr)) != 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to configure NTP UDP sockets: errno %d", errno);
#endif
        closesocket(ipv4_socket);
        closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    struct sockaddr_in6 ipv6_listen_addr{};
    ipv6_listen_addr.sin6_family = AF_INET6;
    ipv6_listen_addr.sin6_port = htons(NTP_PORT);
    ipv6_listen_addr.sin6_addr = in6addr_any;
    if (bind(ipv6_socket, reinterpret_cast<struct sockaddr *>(&ipv6_listen_addr), sizeof(ipv6_listen_addr)) != 0)
    {
#if DEBUG_ENABLED
        ESP_LOGE(TAG, "Unable to bind IPv6 NTP UDP socket: errno %d", errno);
#endif
        closesocket(ipv4_socket);
        closesocket(ipv6_socket);
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        vTaskDelete(nullptr);
        return;
    }

    esp_ip6_addr_t link_local_address{};
    if (ipv6_link_local_socket < 0 ||
        setsockopt(ipv6_link_local_socket, IPPROTO_IPV6, IPV6_V6ONLY, &ipv6_only, sizeof(ipv6_only)) != 0 ||
        setsockopt(ipv6_link_local_socket, SOL_SOCKET, SO_REUSEADDR, &reuse_address, sizeof(reuse_address)) != 0 ||
        esp_netif_get_ip6_linklocal(ETH.netif(), &link_local_address) != ESP_OK)
    {
#if DEBUG_ENABLED
        ESP_LOGW(TAG, "IPv6 link-local NTP listener unavailable: errno %d", errno);
#endif
        if (ipv6_link_local_socket >= 0)
            closesocket(ipv6_link_local_socket);
        ipv6_link_local_socket = -1;
    }
    else
    {
        struct sockaddr_in6 ipv6_link_local_listen_addr{};
        ipv6_link_local_listen_addr.sin6_family = AF_INET6;
        ipv6_link_local_listen_addr.sin6_port = htons(NTP_PORT);
        memcpy(&ipv6_link_local_listen_addr.sin6_addr, link_local_address.addr, sizeof(ipv6_link_local_listen_addr.sin6_addr));
        ipv6_link_local_listen_addr.sin6_scope_id = esp_netif_get_netif_impl_index(ETH.netif());
        if (bind(ipv6_link_local_socket,
                 reinterpret_cast<struct sockaddr *>(&ipv6_link_local_listen_addr),
                 sizeof(ipv6_link_local_listen_addr)) != 0)
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "IPv6 link-local NTP listener unavailable: errno %d", errno);
#endif
            closesocket(ipv6_link_local_socket);
            ipv6_link_local_socket = -1;
        }
    }

    for (;;)
    {
        fd_set read_fds;
        FD_ZERO(&read_fds);
        FD_SET(ipv4_socket, &read_fds);
        FD_SET(ipv6_socket, &read_fds);
        if (ipv6_link_local_socket >= 0)
            FD_SET(ipv6_link_local_socket, &read_fds);
        struct timeval timeout{};
        timeout.tv_sec = 1;
        int max_socket = ipv4_socket;
        if (ipv6_socket > max_socket)
            max_socket = ipv6_socket;
        if (ipv6_link_local_socket >= 0 && ipv6_link_local_socket > max_socket)
            max_socket = ipv6_link_local_socket;
        int ready = select(max_socket + 1, &read_fds, nullptr, nullptr, &timeout);
        if (ready < 0)
        {
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "NTP socket select failed: errno %d", errno);
#endif
            continue;
        }
        if (ready == 0)
            continue;

        static uint8_t next_socket = 0;
        const int sockets[] = {ipv4_socket, ipv6_socket, ipv6_link_local_socket};
        int sock = -1;
        for (size_t offset = 0; offset < sizeof(sockets) / sizeof(sockets[0]); ++offset)
        {
            size_t index = (next_socket + offset) % (sizeof(sockets) / sizeof(sockets[0]));
            if (sockets[index] >= 0 && FD_ISSET(sockets[index], &read_fds))
            {
                sock = sockets[index];
                next_socket = static_cast<uint8_t>((index + 1) % (sizeof(sockets) / sizeof(sockets[0])));
                break;
            }
        }
        if (sock < 0)
            continue;

