roblatour/ESP32TimeServer/main/main.cpp
        uint8_t request[NTP_PACKET_SIZE];
        uint8_t reply[NTP_PACKET_SIZE];
        struct sockaddr_storage source_addr{};
        socklen_t source_addr_len = sizeof(source_addr);

        int len = recvfrom(sock, request, sizeof(request), 0, reinterpret_cast<struct sockaddr *>(&source_addr), &source_addr_len);
        if (len < 0)
        {
            if (errno == EAGAIN || errno == EWOULDBLOCK)
                continue;
#if DEBUG_ENABLED
            ESP_LOGW(TAG, "recvfrom failed: errno %d", errno);
#endif
            continue;
        }

        if (len != static_cast<int>(NTP_PACKET_SIZE))
        {
#if MQTT_ENABLED
            s_ntp_invalid_requests.fetch_add(1);
#endif
            continue;
        }

        uint8_t ntp_version = (request[0] >> 3) & 0x07;
        uint8_t ntp_mode = request[0] & 0x07;
        if (ntp_version < 3 || ntp_version > 4 || ntp_mode != 3)
        {
#if MQTT_ENABLED
            s_ntp_invalid_requests.fetch_add(1);
#endif
            continue;
        }

#if MQTT_ENABLED
        s_ntp_valid_requests.fetch_add(1);
        mqtt_note_ntp_request(source_addr);
#endif
        ntp_reply_status_t status = get_ntp_reply_status();
#if MQTT_ENABLED
        if (status.stratum == 1)
            s_ntp_requests_with_gnss_lock.fetch_add(1);
        else
            s_ntp_requests_without_gnss_lock.fetch_add(1);
#endif
        bool reply_ready = false;
        if (xSemaphoreTake(s_time_mutex, portMAX_DELAY) == pdTRUE)
        {
            uint64_t receive_time = get_current_time_in_ntp64_format();
            uint64_t transmit_time = get_current_time_in_ntp64_format();
            build_ntp_reply(request, reply, receive_time, transmit_time, status);
            xSemaphoreGive(s_time_mutex);
            reply_ready = true;
        }

        if (reply_ready)
        {
            int sent = sendto(sock, reply, sizeof(reply), 0, reinterpret_cast<struct sockaddr *>(&source_addr), source_addr_len);
#if MQTT_ENABLED
            if (sent == static_cast<int>(sizeof(reply)))
                s_ntp_responses.fetch_add(1);
#else
            (void)sent;
#endif
#if DEBUG_ENABLED
            char source_address[IP_ADDRESS_TEXT_SIZE] = "";
            if (format_socket_address(source_addr, source_address, sizeof(source_address)))
                ESP_LOGI(TAG, "NTP -> %s", source_address);
#endif
        }

#if CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: specific to ntp_server_task, the stack report below will only be issued if an NTP request is received.
        //
        // NOTE 2: a NTP stress test should be run when monitoring this task
        //         for this the open source program (also my me) may be used: https://github.com/roblatour/TimeServerStressTest
        //         recommended usage: Start a single stress test, for a duration of 5 seconds, with 100 Concurrent requests
        //         (you may see a higher than normal failure rate, but this will drop when CALCULATE_NTP_SERVER_TASK_STACK_SIZE_ENABLED and DEBUG_ENABLED are both disabled)
        //
        // NOTE 2: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 22000; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("ntp_server_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        vTaskDelay(pdMS_TO_TICKS(50));

        // Results of this testing:
        // ntp_server_task: Stack report: Allocated=22000 bytes, HighWater=19800 bytes unused, PeakUsage=2200 bytes, Suggested=2750 bytes

#endif
    }
}

static void update_display_task(void *parameter)

{
#if LIQUID_CRYSTAL_DISPLAY_ENABLED
    int previous_top_line_message = -1;
    int previous_second = -1;
#if UPTIME_RESTART_BUTTON_ENABLED
    int display_uptime_seconds_counter = 0;
#endif

    for (;;)
    {

#if OTE_UPDATES_ENABLED
        if (render_ote_display())
        {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }
#endif

        time_t now_utc = time(nullptr);
        struct tm utc_tm{};
        gmtime_r(&now_utc, &utc_tm);

        if (utc_tm.tm_sec != previous_second)
        {
            previous_second = utc_tm.tm_sec;

#if UPTIME_RESTART_BUTTON_ENABLED
            if (check_uptime_request())
                display_uptime_seconds_counter = upTimeDisplayWillStayActiveForThisManySeconds;
#endif

            sync_state_t sync_snapshot = get_sync_state_snapshot();

            int required_top_line_message = 0;

            // Determine message code for the first line:
            //
            // Standard 1st line display value .................................... "ESP32 Time Server   "
            // Ethernet not connected ............................................. "ESP32 Time Server[1]"
            // MQTT setup failed .................................................. "ESP32 Time Server[2]"
            // MQTT there are queued items ........................................ "ESP32 Time Server[3]"
            // Sanity check mismatch .............................................. "ESP32 Time Server[4]"
            // PPS missing ........................................................ "ESP32 Time Server[5]"
            // GNSS missing or invalid ............................................ "ESP32 Time Server[6]"
            // GNSS snyc stale .................................................... "ESP32 Time Server[7]"
            // GNSS unlocked ...................................................... "ESP32 Time Server[8]"

            // 98 used for when the button is pressed (normal periodic behaviour) . "ESP32 Time Server's "
            // 99 Time sync underway (normal periodic behaviour)                  . "ESP32 Time Server * "

            // Regarding: sync_snapshot.holdover_mode
            // In timekeeping terminology, holdover is the state where a time server continues providing time from its internal
            // oscillator after losing its external reference (in this case, GNSS/GPS). The device is no longer actively
            // synchronized but is "coasting" on its last-known good time.
            // Holderover mode is not expressly reported on the LCD's top line as it is implied when
            // Sanity check mismatch, PPS missing, GNSS missing or invalid, GNSS snyc stale, or GNSS unlocked
            // are reported.

            if (s_time_setting_in_progress.load())
            {
                required_top_line_message = 99;
            }
            else
            {
                if (!s_ethernet_connected.load())
                    required_top_line_message = 1;
#if MQTT_ENABLED
                else if (s_mqtt_queued_messages_count.load() > 0)
                    required_top_line_message = 3;
                else if (s_mqtt_setup_failed.load() || !s_mqtt_connected.load())
                    required_top_line_message = 2;
#endif
                switch (sync_snapshot.fault)
                {
                case sync_fault_t::sanity_mismatch:
                    required_top_line_message = 4;
                    break;

                case sync_fault_t::pps_missing:
                    required_top_line_message = 5;
                    break;

