roblatour/ESP32TimeServer/main/main.cpp
                case sync_fault_t::gps_invalid:
                    required_top_line_message = 6;
                    break;

                case sync_fault_t::sync_stale:
                    required_top_line_message = 7;
                    break;

                default:
                    if (required_top_line_message == 0)
                        required_top_line_message = s_gnss_locked.load() ? 0 : 8;
                    break;
                }
            }

#if UPTIME_RESTART_BUTTON_ENABLED
            if (display_uptime_seconds_counter > 0)
                required_top_line_message = 98;
#endif

            // Update top line only if it has changed
            if (required_top_line_message != previous_top_line_message)
            {
                char top_line_message[21]; // 20 chars + null
                memset(top_line_message, ' ', sizeof(top_line_message));
                memcpy(top_line_message, "ESP32 Time Server", 17);

                if (required_top_line_message == 99)
                {
                    top_line_message[18] = '*';
                }
                else if (required_top_line_message > 1 && required_top_line_message < 10)
                {
                    top_line_message[17] = '[';
                    top_line_message[18] = '0' + required_top_line_message;
                    top_line_message[19] = ']';
                }
                else if (required_top_line_message == 10)
                {
                    memcpy(top_line_message, "ESP32 Time Server's", 20);
                }

                top_line_message[20] = '\0';

                display_line(0, top_line_message);
                previous_top_line_message = required_top_line_message;
            }

#if UPTIME_RESTART_BUTTON_ENABLED
            if (display_uptime_seconds_counter > 0)
            {
                char uptime_buffer[lcdColumns + 1];
                char centered[lcdColumns + 1];
                memset(centered, ' ', lcdColumns);
                centered[lcdColumns] = '\0';

                get_uptime(uptime_buffer, sizeof(uptime_buffer));
                size_t uptime_len = strlen(uptime_buffer);
                int left_pad = static_cast<int>((lcdColumns - uptime_len) / 2);
                if (left_pad < 0)
                    left_pad = 0;
                if (uptime_len > lcdColumns)
                    uptime_len = lcdColumns;

                memcpy(centered + left_pad, uptime_buffer, uptime_len);

                display_line(1, "uptime is");
                display_line(2, centered);
                display_line(3, " days hrs:mins:secs");
                display_uptime_seconds_counter--;
            }
            else
#endif
            {
                char date_line[16];
                char time_line[24];
                format_local_date_time(now_utc, date_line, sizeof(date_line), time_line, sizeof(time_line));
                display_line(1, date_line);
                display_line(2, time_line);
                display_selected_ip_address(utc_tm.tm_sec);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));

#if CALCULATE_UPDATE_DISPLAY_TASK_STACK_SIZE_ENABLED

        // The following code is used to determine the ideal stack size for this method
        // it only needs to be setup and run once
        //
        // NOTE 1: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 22000; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("update_display_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing:
        // update_display_task: Stack report: Allocated=22000 bytes, HighWater=20032 bytes unused, PeakUsage=1968 bytes, Suggested=2460 bytes

#endif
    }
#else
    for (;;)
    {
#if UPTIME_RESTART_BUTTON_ENABLED
        (void)check_uptime_request();
#endif
        vTaskDelay(pdMS_TO_TICKS(50));
    }
#endif
}

extern "C" void app_main()
{
    setup_pps_input();

    initArduino();

    write_opening_messages_to_the_console();

    setup_mqtt_tf_queue();

    setup_NVM_storage();

    create_mutexes_and_semaphores();

    initialize_the_display();

    setup_up_time_button();

    setup_ethernet_connection();

    setup_for_ote_updates();

    setup_the_gps();

    setup_mqtt();

    xTaskCreatePinnedToCore(ntp_server_task, "ntp_server", 2750, nullptr, 20, nullptr, tskNO_AFFINITY);

    xTaskCreatePinnedToCore(update_display_task, "display_service", 2750, nullptr, 10, nullptr, tskNO_AFFINITY);
}
